# SortingParameterId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BrowserOrganization..::..SortingParameterId Property
BrowserOrganization Class See Also
---
The Id of the parameter used to determine the sorting order of items in the browser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public ElementId SortingParameterId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SortingParameterId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ SortingParameterId {
	ElementId^ get ();
}
```

# See Also
BrowserOrganization Class
Autodesk.Revit.DB Namespace